; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p15---int100n150-m25---int100c200---s315---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 - fuellevel
)

(:init
(sum level0 level6 level6)
(sum level0 level11 level11)
(sum level0 level15 level15)
(sum level1 level6 level7)
(sum level1 level11 level12)
(sum level1 level15 level16)
(sum level2 level6 level8)
(sum level2 level11 level13)
(sum level2 level15 level17)
(sum level3 level6 level9)
(sum level3 level11 level14)
(sum level3 level15 level18)
(sum level4 level6 level10)
(sum level4 level11 level15)
(sum level4 level15 level19)
(sum level5 level6 level11)
(sum level5 level11 level16)
(sum level5 level15 level20)
(sum level6 level6 level12)
(sum level6 level11 level17)
(sum level6 level15 level21)
(sum level7 level6 level13)
(sum level7 level11 level18)
(sum level7 level15 level22)
(sum level8 level6 level14)
(sum level8 level11 level19)
(sum level8 level15 level23)
(sum level9 level6 level15)
(sum level9 level11 level20)
(sum level9 level15 level24)
(sum level10 level6 level16)
(sum level10 level11 level21)
(sum level10 level15 level25)
(sum level11 level6 level17)
(sum level11 level11 level22)
(sum level11 level15 level26)
(sum level12 level6 level18)
(sum level12 level11 level23)
(sum level12 level15 level27)
(sum level13 level6 level19)
(sum level13 level11 level24)
(sum level13 level15 level28)
(sum level14 level6 level20)
(sum level14 level11 level25)
(sum level14 level15 level29)
(sum level15 level6 level21)
(sum level15 level11 level26)
(sum level15 level15 level30)
(sum level16 level6 level22)
(sum level16 level11 level27)
(sum level16 level15 level31)
(sum level17 level6 level23)
(sum level17 level11 level28)
(sum level17 level15 level32)
(sum level18 level6 level24)
(sum level18 level11 level29)
(sum level18 level15 level33)
(sum level19 level6 level25)
(sum level19 level11 level30)
(sum level19 level15 level34)
(sum level20 level6 level26)
(sum level20 level11 level31)
(sum level20 level15 level35)
(sum level21 level6 level27)
(sum level21 level11 level32)
(sum level21 level15 level36)
(sum level22 level6 level28)
(sum level22 level11 level33)
(sum level22 level15 level37)
(sum level23 level6 level29)
(sum level23 level11 level34)
(sum level23 level15 level38)
(sum level24 level6 level30)
(sum level24 level11 level35)
(sum level24 level15 level39)
(sum level25 level6 level31)
(sum level25 level11 level36)
(sum level25 level15 level40)
(sum level26 level6 level32)
(sum level26 level11 level37)
(sum level26 level15 level41)
(sum level27 level6 level33)
(sum level27 level11 level38)
(sum level27 level15 level42)
(sum level28 level6 level34)
(sum level28 level11 level39)
(sum level28 level15 level43)
(sum level29 level6 level35)
(sum level29 level11 level40)
(sum level29 level15 level44)
(sum level30 level6 level36)
(sum level30 level11 level41)
(sum level30 level15 level45)
(sum level31 level6 level37)
(sum level31 level11 level42)
(sum level31 level15 level46)
(sum level32 level6 level38)
(sum level32 level11 level43)
(sum level32 level15 level47)
(sum level33 level6 level39)
(sum level33 level11 level44)
(sum level33 level15 level48)
(sum level34 level6 level40)
(sum level34 level11 level45)
(sum level34 level15 level49)
(sum level35 level6 level41)
(sum level35 level11 level46)
(sum level35 level15 level50)
(sum level36 level6 level42)
(sum level36 level11 level47)
(sum level36 level15 level51)
(sum level37 level6 level43)
(sum level37 level11 level48)
(sum level37 level15 level52)
(sum level38 level6 level44)
(sum level38 level11 level49)
(sum level38 level15 level53)
(sum level39 level6 level45)
(sum level39 level11 level50)
(sum level39 level15 level54)
(sum level40 level6 level46)
(sum level40 level11 level51)
(sum level40 level15 level55)
(sum level41 level6 level47)
(sum level41 level11 level52)
(sum level41 level15 level56)
(sum level42 level6 level48)
(sum level42 level11 level53)
(sum level42 level15 level57)
(sum level43 level6 level49)
(sum level43 level11 level54)
(sum level43 level15 level58)
(sum level44 level6 level50)
(sum level44 level11 level55)
(sum level44 level15 level59)
(sum level45 level6 level51)
(sum level45 level11 level56)
(sum level45 level15 level60)
(sum level46 level6 level52)
(sum level46 level11 level57)
(sum level46 level15 level61)
(sum level47 level6 level53)
(sum level47 level11 level58)
(sum level47 level15 level62)
(sum level48 level6 level54)
(sum level48 level11 level59)
(sum level48 level15 level63)
(sum level49 level6 level55)
(sum level49 level11 level60)
(sum level49 level15 level64)
(sum level50 level6 level56)
(sum level50 level11 level61)
(sum level51 level6 level57)
(sum level51 level11 level62)
(sum level52 level6 level58)
(sum level52 level11 level63)
(sum level53 level6 level59)
(sum level53 level11 level64)
(sum level54 level6 level60)
(sum level55 level6 level61)
(sum level56 level6 level62)
(sum level57 level6 level63)
(sum level58 level6 level64)

(connected l0 l1)
(fuelcost level15 l0 l1)
(connected l0 l2)
(fuelcost level11 l0 l2)
(connected l1 l0)
(fuelcost level15 l1 l0)
(connected l1 l2)
(fuelcost level6 l1 l2)
(connected l2 l0)
(fuelcost level11 l2 l0)
(connected l2 l1)
(fuelcost level6 l2 l1)

(at t0 l0)
(fuel t0 level64)
(= (total-cost) 0)

(at p0 l0)
(at p1 l1)
(at p2 l1)
(at p3 l2)
(at p4 l1)
(at p5 l2)
(at p6 l2)
(at p7 l1)
(at p8 l0)
(at p9 l1)
(at p10 l0)
(at p11 l0)
(at p12 l1)
(at p13 l1)
(at p14 l1)
)

(:goal
(and
(at p0 l1)
(at p1 l0)
(at p2 l0)
(at p3 l0)
(at p4 l0)
(at p5 l0)
(at p6 l0)
(at p7 l2)
(at p8 l1)
(at p9 l2)
(at p10 l1)
(at p11 l2)
(at p12 l0)
(at p13 l0)
(at p14 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 0 of 15
2. (load p11 t0 l0)
   deleted: (at p11 l0)
   added: (in p11 t0)
   goals met: 0 of 15
3. (load p10 t0 l0)
   deleted: (at p10 l0)
   added: (in p10 t0)
   goals met: 0 of 15
4. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 15
5. (drive t0 l0 l1 level49 level15 level64)
   deleted: (at t0 l0) (fuel t0 level64)
   added: (at t0 l1) (fuel t0 level49)
   goals met: 0 of 15
6. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 1 of 15
7. (unload p10 t0 l1)
   deleted: (in p10 t0)
   added: (at p10 l1)
   goals met: 2 of 15
8. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 3 of 15
9. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 3 of 15
10. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 3 of 15
11. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 3 of 15
12. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 3 of 15
13. (load p14 t0 l1)
   deleted: (at p14 l1)
   added: (in p14 t0)
   goals met: 3 of 15
14. (load p13 t0 l1)
   deleted: (at p13 l1)
   added: (in p13 t0)
   goals met: 3 of 15
15. (load p12 t0 l1)
   deleted: (at p12 l1)
   added: (in p12 t0)
   goals met: 3 of 15
16. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 3 of 15
17. (drive t0 l1 l2 level43 level6 level49)
   deleted: (at t0 l1) (fuel t0 level49)
   added: (at t0 l2) (fuel t0 level43)
   goals met: 3 of 15
18. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 4 of 15
19. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 5 of 15
20. (unload p11 t0 l2)
   deleted: (in p11 t0)
   added: (at p11 l2)
   goals met: 6 of 15
21. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 6 of 15
22. (load p5 t0 l2)
   deleted: (at p5 l2)
   added: (in p5 t0)
   goals met: 6 of 15
23. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 6 of 15
24. (drive t0 l2 l0 level32 level11 level43)
   deleted: (at t0 l2) (fuel t0 level43)
   added: (at t0 l0) (fuel t0 level32)
   goals met: 6 of 15
25. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 7 of 15
26. (unload p12 t0 l0)
   deleted: (in p12 t0)
   added: (at p12 l0)
   goals met: 8 of 15
27. (unload p13 t0 l0)
   deleted: (in p13 t0)
   added: (at p13 l0)
   goals met: 9 of 15
28. (unload p14 t0 l0)
   deleted: (in p14 t0)
   added: (at p14 l0)
   goals met: 10 of 15
29. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 11 of 15
30. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 12 of 15
31. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 13 of 15
32. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 14 of 15
33. (unload p6 t0 l0)
   deleted: (in p6 t0)
   added: (at p6 l0)
   goals met: 15 of 15
